app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pages" SET "name" = 'Article with Image', "content" = '<p><img src="http://images.suite101.com/3502992_com_one_crazy_summer_poster.jpg" align="left"></p><h3>A Crazy Summer Comes to an End</h3><p>What makes&nbsp;<em>One Crazy Summer</em>&nbsp;work is that it understands and reflects the spirit of summer vacation. Hanging out with these characters feels like hanging out with one''s friends. The film’s shaggy plot is a perfect filmic representation of those loose, wandering days of vacation and even the film’s goofy, cartoonish sense of humor reminds the audience of cracking jokes with their friends. Watching the film is like remembering the summers of days-gone-by.</p><p>There’s a bittersweet feeling to the movie’s finale; the movie ends on a triumphant note but it’s an ending all the same. These weird characters the viewer has gotten to know and grown to love are about to disappear and the fun will finally come to a close. Much like summer, the viewer is left only with his or her memories and a happy feeling knowing that he or she has had a great time. Few movies quite capture that experience, and&nbsp;<em>One Crazy Summer</em>&nbsp;is one of the best.</p><p><strong><em>One Crazy Summer</em></strong></p><ul><li>Director: Savage Steve Holland</li><li>Starring John Cusack, Demi Moore, Bobcat Goldthwait</li><li>Studio: Warner Bros., 1986</li><li>Running Time: 89 minutes</li></ul><br><p></p><p></p>', "updated_at" = '2011-11-08 17:39:41.133530' WHERE "pages"."id" = 3
---
  def mercury_update
    page = Page.find(params[:id])
    page.name = params[:content][:page_name][:value]
    page.content = params[:content][:page_content][:value]
    page.save!